#include <iostream>
#include <vector>

using namespace std;


//d[k]라는 점화식을 만들어야 하는데, 일단 대표적으로 D[12]를 생각해보자
//k는 숫자 그 자체
//점화식을 통해 수열을 만든다고 생각하고 접근하면 됨
//d[1]~d[k]까지 수열을 만든다고 생각하자(차근차근 맞춰나가면서 올라가는 것)
//D[k] = D[k/3] + 1
//D[k] = D[k/2] + 1
//D[k] = D[k-1] + 1
//초기값은 D[1] = 0 (피보나치 수열에서 초항을 1,2 이렇게 잡는 것처럼)
//초기값이 1개 필요한지 3개 필요한지 2개 필요한지 잘 고민해보기

int main(){
    ios::sync_with_stdio(0);
    cin.tie(0);
    int n=0;
    cin >> n;
    vector<int> d(1000005); // 이렇게 미리 vector를 잡아 줘야지 메모리 초과 안당한다 꼭 기억해
//점화식이기 때문에 거꾸로 올라가는 형상을 띔
    for(int i = 2; i <= n; i++){
        d[i] = d[i-1]+1;
        if(i%2 == 0) d[i] = min(d[i],d[i/2]+1); //1을 뺀 값이 더 작냐, 2를 나누고 1을 더한값이 더 작냐 (더 빠르게 1로 다가가는 것을 고르니까)
        if(i%3 == 0) d[i] = min(d[i],d[i/3]+1);
    }
    cout << d[n];
}

