import sys, math

#생각 과정(나중에 공부한 것 재복습할때를 위해서)
#문제를 보면 교수님이 P(t) = (1 - t) * A + t * B 이 함수를 활용해보라고 했는데 여기서 최소값만 찾으면 된다는 것
#2차함수이기도 하고 아래로 볼록한 함수만 만들기 때문에 이것만 찾아버리면 됨
#그러면 2차함수에다가 두개의 점을 찍은 다음에 둘이 대소 비교해서 높은 쪽 부분보다 큰부분 싹 버리고 나머지 2/3부분만 남기면 된다. 이걸 반복시키면 됨
def T(mydist, l, h):
    for _ in range(91): #배정밀도 관련 공부랑 검색을 병행
        #while문을 사용하지 말고 그냥 부동소수점을 이용해서 부동소수점 한계까지만 반복시키면 된다는 아이디어를 검색해서 찾아서 적용시켰습니다.
        #원래는 while문으로 무한반복시켰는데 파이썬에서는 double 배정밀도를 실수float의 자료형객체로 사용함.
        #배정밀도 1 / 11 / 52으로 진수부가 2^52(52비트) 그리고 1.XX로 정규화때문에 실제 표현가능한 소수점이 2^53(53비트)임.
        #이걸 상용로그취해보면 15.955XX 이렇게 되므로 10^16정도가 되니까 소수점 16자리(사실 이래서 0.1 + 0.2 ≠ 0.3 이거 유명한것도 있음(무한소수))
        
        #배정밀도는 16자리까지 정밀도를 가진다는 것 알아두자
        #지금 내가 사용하려는 것이 그래프에 점 2개를 찍는 것인데 이러면 구간이 총 3개가 나오므로 삼분탐색이라고 할 수 있음
        #계속 2/3이 반복되서 곱해지니까 (2/3)^91에 상용로그 씌워보면 -16 정도가 나오기 때문에 91번 반복하면 배정밀도 끝까지 간다(이후는 어쩌피 표현 못해서 사용 못하니까 버려도 됨)

        # zip 함수를 통해서 파이썬이 l,h리스트에서 각각 같은 인덱스
        # m = [(x*2 + y)/3 for x, y in zip(l, h)]
        # n = [(x + y*2)/3 for x, y in zip(l, h)]
        #zip함수에서 zip("리스트로된 행렬")꼴을 처리할때 Unzipping으로 
        #내 zip설명 마크다운의 zip(*pairs) 부분 보면 된다. 암튼 이렇게 대량의 2차원 리스트를 한꺼번에 같은 인덱스끼리 묶은 2차원 리스트로 행과 열을 바꿔버릴 수 있음

        #C스타일로 1/3,2/3하는 것은 인덱스 접근으로 이렇게 함
        m = [(l[i] * 2 + h[i]) / 3 for i in range(len(l))]
        n = [(l[i] + h[i] * 2) / 3 for i in range(len(l))]
        
        #2/3으로 범위 축소
        if mydist(m) > mydist(n): l = m
        else: h = n
    return mydist(l) #mydist에 math.dist함수를 계속 받을 최종

# 2. 메인 로직: 입력 및 실행
# 4줄의 좌표를 읽어 A, B, C, E에 즉시 할당
A, B, C, E = [list(map(int, sys.stdin.readline().split())) for _ in range(4)]

#삼중분할을 총 2번 한다. 일단 삼중분할 한번 하고 
print(math.ceil(T(lambda x: T(lambda y: math.dist(x, y), C, E), A, B)) - 1e-9)