#include <iostream>
#include <vector>

using namespace std;

// 이전 문제처럼 dp로 생각
// d[4]의 경우
//1+2+3 ... 형식으로 나타낼 때 오름차순시 끝에 1,2,3 중 하나가 올텐데 그것으로 나누어 보자
// 가장 끝에 오는 수가 3일때(1+3) 3을 1,2,3의 합으로 나타내는 법 d[3] = d[i-3]
// 가장 끝에 오는 수가 2일때(1+1+2)... 2을 1,2의 합으로 나타내는 법 d[2] = d[i-2]
// 가장 끝에 오는 수가 1일때(2+1+1)(3+1)... 1을 1의 합으로 나타내는 법 d[1] = d[i-1]

//이런 방식으로 나누어 줄 수 있다.
//그럼 점화식은
// d[i] = d[i-1] + d[i-2] + d[i-3];
//초기값은 d[4] = d[3] + d[2] + d[1]; d[3]=4 d[2]=2 d[1]=1


int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);

    vector<int> d(20);
    d[1] = 1; d[2] = 2; d[3] = 4;
    for(int i = 4; i < 11; i++)
        d[i] = d[i-1] + d[i-2] + d[i-3];

    int t;
    cin >> t;
    while(t--){
        int n;
        cin >> n;
        cout << d[n] << '\n';
    }
}